PanAndrew/STM32_AMP/STM32F3_AMP/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SPI1_SS_Pin GPIO_PIN_3
#define SPI1_SS_GPIO_Port GPIOE
#define GPS_UART3_RX_Pin GPIO_PIN_15
#define GPS_UART3_RX_GPIO_Port GPIOE
#define GPS_UART3_TX_Pin GPIO_PIN_10
#define GPS_UART3_TX_GPIO_Port GPIOB
#define Encoder_R_Pin GPIO_PIN_10
#define Encoder_R_GPIO_Port GPIOD
#define Encoder_R_EXTI_IRQn EXTI15_10_IRQn
#define Encoder_L_Pin GPIO_PIN_11
#define Encoder_L_GPIO_Port GPIOD
#define Encoder_L_EXTI_IRQn EXTI15_10_IRQn
#define BridgeB_2_Pin GPIO_PIN_12
#define BridgeB_2_GPIO_Port GPIOD
#define BridgeB_1_Pin GPIO_PIN_13
#define BridgeB_1_GPIO_Port GPIOD
#define BridgeA_2_Pin GPIO_PIN_14
#define BridgeA_2_GPIO_Port GPIOD
#define BridgeA_1_Pin GPIO_PIN_15
#define BridgeA_1_GPIO_Port GPIOD
#define SPI3_SS_Pin GPIO_PIN_0
#define SPI3_SS_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
